/*
 * Root_of_AVL_Tree.cpp
 *
 *  Created on: 2018年4月18日
 *      Author: Administrator
 */


/*
04-树5 Root of AVL Tree（25 分）

一个平衡二叉树是一个自平衡的二叉查找树。在一个平衡二叉树中，任何节点的两个子树的高度差最多为1。
任何时候平衡因子大于 1 的时候，那么重新平衡这棵树就可以恢复平衡二叉树的特性。

现在给你一组插入值，你应该给出平衡二叉搜索树的根。

输入格式：
每一个文件包含一个测试点，对于每个测试，第一行给出一个正数值说明有多少个插入点。
然后 N 个插入点的正数值会在下一行给出，所有在一行的数字都被空格隔开。

输出格式：
对于每一个测试点，打在一行中打印出平衡二叉搜索树的根。

Sample Input 1:

5
88 70 61 96 120
Sample Output 1:

70
Sample Input 2:

7
88 70 61 96 120 90 65
Sample Output 2:

88
*/





